export default {

  // Validation
  BAD_NAME: 'Имя должно содержать от 2 до 30 символов',
  BAD_PASSWORD: 'Ваш пароль не соответствует необходимым требованиям',
  BAD_EMAIL: 'Введите адрес электронной почты',
  EMPTY_FIELD: 'Это обязательное поле',
  DB_CONFLICT: 'Пользователь с таким адресом уже зарегистрирован',
  FORBIDDEN: 'У Вас недостаточно прав',

  // Errors
  NO_RESULTS: 'К сожалению по вашему запросу ничего не найдено.',
  DEFAULT_ERROR: 'Возможно, проблема с соединением или сервер недоступен. Подождите немного и попробуйте ещё раз',

  // CardList Properties
  ALLOWED_AMOUNT: 3,

  // Card Properties
  LOG_IN: 'Войдите, чтобы сохранять статьи',
  DELETE_FROM_SAVED: 'Убрать из сохраненных',

};
